/*1.2. Да се напише програма, чрез която се въвежда N цифрено дълго число.
Първата и последната цифра се по-големи от 0. На основа въведеното число
се разглеждат две дълги числа – четено отляво-надясно и отдясно-наляво.
Програмата да съхранява цифрите на дългото число в опашка и да изведе
съобщение кое от двете дълги числа е по-голямо или и двете са равни.
Пример: N=18 число: 284941998579660387
Изход: симетричното число е по-голямо.
Реализирана от вас структура от данни трябва да представлява шаблонен клас, който да
осигурява основните методи и функции за опашка.
*/

#include <iostream>
using namespace std;

int main() {
    int input;
    cin >> input;

    long number;


}